<a href="https://colab.research.google.com/github/RojaCM/Sample-files/blob/main/Outlier%20detection%20and%20removal%20using%20IQR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

IQR - Inter Quartile Range

IQR = Q3-Q1

lower limit = Q1 -1.5*IQR

upper limit = Q3+1.5*IQR

In [1]:
import pandas as pd

In [2]:
from google.colab import files
uploaded = files.upload()

Saving heights.csv to heights.csv

In [3]:
df = pd.read_csv('heights.csv')

In [4]:
df

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [6]:
df.describe()

          height
count  20.000000
mean    8.390000
std     8.782812
min     1.200000
25%     5.350000
50%     5.700000
75%     6.275000
max    40.200000

In [7]:
Q1 = df.height.quantile(0.25)

In [9]:
Q3 = df.height.quantile(0.75)

In [10]:
IQR = Q3 - Q1

In [11]:
lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

In [12]:
df1 = df[(df['height']>lower_limit) & (df['height']<upper_limit)]

In [13]:
df1

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1

In [14]:
df[(df['height']>upper_limit)]

     name  height
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [16]:
df[(df['height']<lower_limit)]

    name  height
0  mohan     1.2
1  maria     2.3